Revit 2024 API
Application.Language Property
The language used in the current session of Revit.
Namespace: Autodesk.Revit.ApplicationServices
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public LanguageType Language { get; }
Visual Basic
Public ReadOnly Property Language As LanguageType
	Get
Visual C++
public:
property LanguageType Language {
	LanguageType get ();
}
Remarks
Use this property to determine the language used by Revit; this can allow your application to load the appropriate resources.
See Also
Application Class
Autodesk.Revit.ApplicationServices Namespace